final fxA = [
  '前方伸身1回ひねり',
  '後方屈伸ダブル',
  '後方1回半ひねり',
  '前方2回半ひねり',
  '後方伸身ムーンサルト',
  '後方2回半ひねり',
  '前方伸身半分ひねり',
  'テンポ宙返り',
  '切り返し前宙伏せ',
  '後方抱え込みルドルフ',
];

final fxB = [
  '前方伸身1回ひねり',
  '後方屈伸ダブル',
  '後方1回半ひねり',
  '前方2回半ひねり',
  '後方伸身ムーンサルト',
  '前方伸身半分ひねり',
  'シンピ(伸肘)倒立',
  'テンポ宙返り',
  '切り返し前宙伏せ',
  '後方2回半ひねり',
];

final hbA = [
  'コスミック(ヤマワキ)',
  'エンドー',
  'ツォ・リミン',
  '伸身トカチェフ',
  'ギンガー',
  'ホップターン',
  '閉脚シュタルダー',
  'ホップハーフ',
  '閉脚エンドー',
  '後方伸身2回宙返り下り',
];

final hbB = [
  'コスミック(ヤマワキ)',
  'エンドー',
  'ツォ・リミン',
  'ブレッドシュナイダー',
  'カッシーナ',
  'ペガン',
  'リバルコ',
  'ホップハーフ',
  '閉脚エンドー',
  'フェドルチェンコ',
];

final phA = [
  'バックセアー',
  'Cセアー',
  'ロス',
  'Cトンフェイ',
  '縦向き旋回',
  'シュテクリB',
  'フクガ',
  '旋回',
  '倒立2回ひねり下り',
];

final phB = [
  'リーニン',
  'ブスナリ',
  'ロス',
  'Dフロップ',
  'モギルニー',
  'Cトンフェイ',
  'フクガ',
  '旋回',
  'ウ・グォニアン',
  'E下り(逆リアー)',
];

final pbA = [
  'ピンコ',
  'ホンマ',
  'アームライヘルト',
  '棒下倒立',
  '車輪〜単棒倒立',
  '単棒ヒーリー',
  'ツイスト',
  'ディアミドフ',
  '前振り上がり',
  '後方屈伸宙返り下り',
];

final pbB = [
  'アームカット',
  'マクーツ',
  '棒下ハーフ',
  '棒下倒立',
  'モイ',
  'バブサー',
  'ティッペルト(チッペルト)',
  'シンピ(伸肘)倒立',
  '前方抱え込み2回宙返りひねり下り',
];
