Map<String, int> fxA = {
  "開脚（閉脚）旋回二周": 1,
  "開脚旋回ひねり": 1,
  "ロシアン360°（540°）転向": 1,
  "後転倒立ひねり": 1,
  "前方抱え込み（屈伸）宙返り": 2,
  "前方抱え込み（屈伸）宙返り半分ひねり": 2,
  "後方抱え込み（屈伸）宙返り": 3,
  "後方抱え込み（屈伸）宙返り半分ひねり": 3,
  "バク転": 3,
};

Map<String, int> fxB = {
  "脚上挙（2秒）": 1,
  "開脚座（脚前挙、開脚前挙）から伸肘倒立": 1,
  "倒立(立位、振動)から十字倒立": 1,
  "閉脚上水平支持": 1,
  "開脚上水平支持から伸腕伸身力倒立": 1,
  "倒立前転開脚浮腰支持経過倒立": 1,
  "閉脚（開脚）旋回倒立": 1,
  "倒立から下ろして閉脚（開脚）旋回": 1,
  "開脚シュピンデル": 1,
  "開脚旋回ひねり倒立": 1,
  "ロシアン720°（900°）転向": 1,
  "前方伸身宙返り": 2,
  "前方抱え込み宙返り一回ひねり": 2,
  "前方伸身宙返り半分ひねり": 2,
  "前方抱え込み一回半ひねり": 2,
  "後方伸身宙返り": 3,
  "後方伸身宙返り半分ひねり": 3,
  "テンポ宙返り": 3,
  "後方抱え込み一回半ひねり": 3,
  "後方伸身宙返り一回ひねり": 3,
};

Map<String, int> fxC = {
  "マンナ": 1,
  "脚上挙支持から倒立": 1,
  "開脚座から十字倒立": 1,
  "中水平支持（2秒）": 1,
  "水平支持から倒立": 1,
  "倒立から伸膝前転脚前挙支持経過倒立": 1,
  "ゴゴラーゼ": 1,
  "開脚旋回270°以上ひねり倒立": 1,
  "フェドルチェンコ": 1,
  "前方伸身一回ひねり": 2,
  "前方伸身一回半ひねり": 2,
  "後方抱え込みダブル": 3,
  "後方屈伸ダブル": 3,
  "後方伸身一回半ひねり": 3,
  "後方伸身二回ひねり": 3,
};

Map<String, int> fxD = {
  "マンナ（2秒）から力倒立（2秒）": 1,
  "マンナ（2秒）から肩返し倒立（2秒）": 1,
  "アルバリーニョ": 1,
  "開脚旋回跳び一回ひねり倒立、開脚旋回（二回のとびを伴う）": 1,
  "開脚旋回270°以上ひねり直接倒立、下ろして閉脚（開脚）旋回": 1,
  "モランディ": 2,
  "前方抱え込みダブル": 2,
  "前方伸身二回ひねり": 2,
  "デファー": 2,
  "抱え込みサルト": 3,
  "後方ダブルハーフ": 3,
  "後方伸身二回半ひねり": 3,
  "後方伸身三回ひねり": 3,
  "後方伸身ダブル": 3,
};

Map<String, int> fxE = {
  "前方屈伸ダブル": 2,
  "前方抱え込みダブルハーフ": 2,
  "前方伸身二回半ひねり": 2,
  "抱え込みルドルフ": 3,
  "抱え込みサルトハーフ": 3,
  "後方伸身三回半ひねり": 3,
  "ロウユン": 3,
  "タマヨ": 3,
  "伸身サルト": 3,
};

Map<String, int> fxF = {
  "前方屈伸ダブルハーフ": 2,
  "前方伸身三回ひねり": 2,
  "前方抱え込みサルト": 2,
  "後方伸身四回ひねり": 3,
  "コリバノフ": 3,
  "ヒポリト（後方伸身サルトハーフ）": 3,
  "伸身リジョンソン": 3,
};

Map<String, int> fxG = {
  "リジョンソン": 3,
  "リジョンソンハーフ": 3,
};

Map<String, int> fxH = {
  "リューキン（後方抱え込み三回宙返り）": 3,
  "シライ３（後方伸身二回宙三回ひねり）": 3,
};
